module.exports = {
    command: 'قوانين',
    description: 'عرض قوانين الجروب',
    usage: '.قوانين',
    category: 'group',    
    
    async execute(sock, msg) {
        try {
            const decoratedText = `『قوانين🎩:   𝑺.  𝑯.  𝑹』

*『القوانـ🔰ين』*

࿇ ══━━━━✥🌪️✥━━━━══࿇
‏ *‏‏‏‏『المخالفات (الانـ⛔ـذارات) 』*

࿇ ══━━━━✥🌪️✥━━━━══࿇
1-ارسال gif برا الانمي 

2- ممـ🚫ـنوع ارسال ملصقات الكيبوب او ملصقات مخله بالآداب.

3- 3 ملصقات ورا بعض بدون رسايل سبام.

4- 9 رسائل ورا بعض 3 منها دون فائدة سبام.

5- السبام و التشفير..
7ـ التحدث عن الهنتاي و الإيتشي.
8ـ العنصرية بكل أشكالها.

9ـ التحدث في الامور السياسية ونحوها.
10-ممنوع تكلم بالهجة غير العامة +ممنوع تكلم بالغة غير العربية

11- التحدث عن حلقة لم يمر عليها 7 ساعات..
12- التنمر على الاعضاء.
13- تسجيل الصوتية للبنات.
14- الصوتيات عالية الصوت المزعجه.
15- إرسال مقطع خارج الانمي في يوم غير مفتوح.
16- القذف.
17 طلب رتبة وازعاج المسؤولين.
18-ارسال اي رابط كان في المجموعة (بإستثناء المشرفين بس يرسلون روابط خاصة بالقروب مثل الفروع و القروب الديني ...)
19-  الاتصال على القروب في اي ظرف كان 

࿇ ══━━━━✥🎩✥━━━━══࿇
‏ *‏‏‏‏『قوانـ🔰ـين الطـ⌛️ـرد الموقت』*

1- الإحتكاك الغير لائق بين الجنسين في الخاص او العام.

2-الإعتراض على قرارات المشرفين و التدخل فيها

*ذا خذيت طردين راح يتحول الى موبد*
࿇ ══━━━━✥🌪️✥━━━━══࿇
‏ *‏‏‏‏『قوانـ🔰ـين الطـ🚯ـرد الموبد』*

1- الحرق بجميع صوره.

2- النشر لقروب آخر .

3- إرسال أي صورة أو مقطع أو ملصق هنتاي.

4- الدخول بنية التخريب أو سرقة الأعضاء.

5- تهديد الاعضاء بالباند وغيرها.

6- السب والشتم.

7- إرسال اكثر من ملصق دفعة واحدة وبنفس الوقت

8-ارسال صورة لوجهك او وجه شخص في القروب او خويك.... الخ.

9- افتعال مشاكل متعمدة (بالنقابة)

10-تغلط على شخص بالخاص او تبتزة بشكل عام واشتكى عليك

11- إرسال صورة أو مقطع غير لائق سواءً كان من إنمي أو غير الإنمي.

*ممنـ🚫ـوع الخروج ودخول المتكرر*

↜4 | إنذارات =   طرد لمـدة يومين
↜6 | إنذارات =   طرد مؤبـد
↜تحذير مهم =  يستطيع المشرف طردك موبد ذا انت تكرر نفس الإنذارات 
*إذا لزم الأمر يمكن للمشرف أن يطبق قانون غير مذكور*
࿇ ══━━━━✥🌪️✥━━━━══࿇

*تنحذف الانذارات بعد ٣ ايام من اخذها*

࿇ ══━━━━✥🌪️✥━━━━══࿇
*مــ؏ تـحـيـات اداࢪة*

*『𝑺.𝑯.𝑹⊰🌀⊱𝑲𝑶𝑵𝑶𝑯𝑨』*`

            await sock.sendMessage(msg.key.remoteJid, {
                text: decoratedText,
                mentions: [msg.sender]
            }, { quoted: msg });
        } catch (error) {
            console.error('❌', 'Error executing استمارة:', error);
            await sock.sendMessage(msg.key.remoteJid, {
                text: responses.error.general(error.message || error.toString())
            }, { quoted: msg });
        }
    }
}