const azkar = [
  "🕌 *أذكار الصباح:*\n\nاللّهـمّ أنت ربـي، لا إله إلاّ أنت، خلقتنـي وأنا عبدك...",
  "🕌 *أذكار المساء:*\n\nرَضيـتُ بِاللهِ رَبَّاً، وبِالإسْلامِ ديـناً، وبِمُحَـمَّدٍ ﷺ نَبِيّـاً.",
  "🕌 *ذكر يحبه الرحمن:*\n\nسُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ الْعَظِيمِ.",
  "🕌 *أعظم الذكر:*\n\nلَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ...",
  "🕌 *تحصين النفس:*\n\nبِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ...",
  "🕌 *استغفار:*\n\nأستغفرُ اللهَ العظيمَ وأتوبُ إليه."
];

module.exports = {
  command: 'أذكاري',
  description: '🌄 ذكر عشوائي صباحي أو مسائي',
  usage: '.أذكاري',
  category: 'ديني',

  async execute(sock, msg) {
    const randomZikr = azkar[Math.floor(Math.random() * azkar.length)];
    await sock.sendMessage(msg.key.remoteJid, { text: randomZikr }, { quoted: msg });
  }
};